
 const ImageCollection = [
    {
        id: 203, 
        imgH:'constr_image/L_ZIIIUltra_h1.png',
        imgV:'constr_image/L_ZIIIUltra_v1.png',
    },
    {
        id: 401, 
        imgH:'constr_image/L_50_h.png',
        imgV:'constr_image/L_50_v.png',
    },
    {
        id: 402, 
        imgH:'constr_image/L_50_h.png',
        imgV:'constr_image/L_50_v.png',
    },
    {
        id: 403, 
        imgH:'constr_image/L_50_h.png',
        imgV:'constr_image/L_50_v.png',
    },
    {
        id: 404, 
        imgH:'constr_image/L_50_h.png',
        imgV:'constr_image/L_50_v.png',
    },
    {
        id: 405, 
        imgH:'constr_image/L_Vibr_v.png',
        imgV:'constr_image/L_Vibr_v.png',
    },
   
]

const Constructions = [
    {
        id: 100, 
        title: 'ПЕРЕГОРОДКИ',
        description: 'Название раздела',
        id_type: 'W'
    },
    {
        id: 101, 
        title: 'Перегородка на каркасе 50 мм',
        description: 'Перегородка на одинарном каркасе 50 мм',
        id_type: 'W'
    },
    {
        id: 102, 
        title: 'Перегородка на каркасе 75 мм',
        description: 'Перегородка на одинарном каркасе 75 мм',
        id_type :'W'
    },
    {
        id: 103, 
        title: 'Перегородка на каркасе 100 мм',
        description: 'Перегородка на одинарном каркасе 100 мм',
        id_type:'W'
    },
    {
        id: 104, 
        title: 'Перегородка на каркасе Wave 100 мм',
        description: 'Перегородка на одинарном каркасе Виброфлекс-Wave 100 мм',
        id_type:'W'
    },
    {
        id: 105, 
        title: 'Перегородка на каркасе 2x50 мм',
        description: 'Перегородка на двойном (независимом) сдвоенном каркасе 2x50 мм на раздельных основаниях звукоизолирующих полов',
        id_type:'W'
    },
    {
        id: 106, 
        title: 'Перегородка на каркасе 2x75 мм',
        description: 'Перегородка на двойном (независимом) сдвоенном каркасе 2x75 мм на раздельных основаниях звукоизолирующих полов',
        id_type:'W'
    },
    {
        id: 107, 
        title: 'Перегородка на каркасе 2x100 мм',
        description: 'Перегородка на двойном (независимом) сдвоенном каркасе 2x100 мм на раздельных основаниях звукоизолирующих полов',
        id_type:'W'
    },
    {
        id: 108, 
        title: 'Перегородка системы Саундлайн dB-X AL',
        description:'Перегородка системы Саундлайн dB-X AL на одинарном каркасе 50 мм',
        id_type:'W'
    },
    // {
    //     id: 201, 
    //     title: 'ЗИПС-Вектор',
    //     description: 'Звукоизолирующая система ЗИПС-Вектор, смонтированная на стене',
    //     id_type:'Z'
    // },
    // {
    //     id: 202, 
    //     title: 'ЗИПС-Модуль',
    //     description: 'Звукоизолирующая система ЗИПС-Модуль, смонтированная на стене',
    //     id_type:'Z'
    // },
    // {
    //     id: 203, 
    //     title: 'ЗИПС-III-Ультра',
    //     description: 'Звукоизолирующая система ЗИПС-III-Ультра, смонтированная на стене',
    //     id_type:'Z'
    // },
    // {
    //     id: 204, 
    //     title: 'ЗИПС-Z4',
    //     description: 'Звукоизолирующая система ЗИПС-Z4, смонтированная на стене',
    //     id_type:'Z',
    // },
    // {
    //     id: 205, 
    //     title: 'ЗИПС-Синема',
    //     description: 'Звукоизолирующая система ЗИПС-Синема, смонтированная на стене',
    //     id_type:'Z'
    // },
    {
        id: 200, 
        title: 'ОБЛИЦОВКА',
        description: 'Название раздела',
        id_type:'L'
    },
    {
        id: 201, 
        title: 'ЗИПС-Вектор',
        description: 'Звукоизолирующая система ЗИПС-Вектор, смонтированная на стене',
        id_type:'L'
    },
    {
        id: 202, 
        title: 'ЗИПС-Модуль',
        description: 'Звукоизолирующая система ЗИПС-Модуль, смонтированная на стене',
        id_type:'L'
    },
    {
        id: 203, 
        title: 'ЗИПС-III-Ультра',
        description: 'Звукоизолирующая система ЗИПС-III-Ультра, смонтированная на стене',
        id_type:'L'
    },
    {
        id: 204, 
        title: 'ЗИПС-Z4',
        description: 'Звукоизолирующая система ЗИПС-Z4, смонтированная на стене',
        id_type:'L',
    },
    {
        id: 205, 
        title: 'ЗИПС-Синема',
        description: 'Звукоизолирующая система ЗИПС-Синема, смонтированная на стене',
        id_type:'L'
    },
    {
        id: 500, 
        title: 'ПОТОЛОК',
        description: 'Название раздела',
        id_type:'C'
    },
    {
        id: 201, 
        title: 'ЗИПС-Вектор',
        description: 'Звукоизолирующая система ЗИПС-Вектор, смонтированная на потолке',
        id_type:'C'
    },
    {
        id: 202, 
        title: 'ЗИПС-Модуль',
        description: 'Звукоизолирующая система ЗИПС-Модуль, смонтированная на потолке',
        id_type:'C'
    },
    {
        id: 203, 
        title: 'ЗИПС-III-Ультра',
        description: 'Звукоизолирующая система ЗИПС-III-Ультра, смонтированная на потолке',
        id_type:'C'
    },
    {
        id: 204, 
        title: 'ЗИПС-Z4',
        description: 'Звукоизолирующая система ЗИПС-Z4, смонтированная на потолке',
        id_type:'C',
    },
    {
        id: 205, 
        title: 'ЗИПС-Синема',
        description: 'Звукоизолирующая система ЗИПС-Синема, смонтированная на потолке',
        id_type:'C'
    },
    {
        id: 401, 
        title: 'Облицовка на каркасе 50 мм',
        description: 'Облицовка на независимом сдвоенном каркасе 50 мм',
        id_type:'L'
    },
    {
        id: 402, 
        title: 'Облицовка на каркасе 75 мм',
        description: 'Облицовка на независимом каркасе 75 мм',
        id_type:'L'
    },
    {
        id: 403, 
        title: 'Облицовка на каркасе 100 мм',
        description: 'Облицовка на независимом каркасе 100 мм',
        id_type:'L'
    },
    {
        id: 404, 
        title: 'Облицовка c применением Виброфлекс-Коннект ПС',
        description: 'Облицовка на каркасе ПП 60/27 с применением креплений Виброфлекс-Коннект ПС',
        id_type:'L'
    },
    {
        id: 405, 
        title: 'Облицовка с применением Виброфлекс-КС',
        description: 'Облицовка на каркасе ПП 60/27 с применением креплений Виброфлекс-КС',
        id_type:'L'
    },
  
    {
        id: 501, 
        title: 'Потолок на креплениях Виброфлекс-Коннект ПП',
        description: 'Подвесной потолок, смонтированный на креплениях Виброфлекс-Коннект ПП',
        id_type:'C'
    },
    {
        id: 502, 
        title: 'Потолок на креплениях Виброфлекс-К15',
        description: 'Подвесной потолок, смонтированный на креплениях Виброфлекс-К15',
        id_type:'C'
    },
    {
        id: 503, 
        title: 'Потолок на креплениях Виброфлекс-К15 с удлинителями',
        description: 'Подвесной потолок, смонтированный на креплениях Виброфлекс-К15 с удлинителями из профиля ПП 60/27',
        id_type:'C'
    },
    {
        id: 600, 
        title: 'ПОЛ',
        description:'Название раздела',
        id_type:'F'
    },
    {
        id: 601, 
        title: 'Пол Акуфлекс-Супер, паркет, 15мм',
        description:'Паркетная доска 15 мм на материале Акуфлекс-Супер',
        id_type:'F'
    },
    {
        id: 602, 
        title: 'Пол Акуфлекс-Супер, ламинат, 8 мм',
        description: 'Ламинат 8 мм на материале Акуфлекс-Супер',
        id_type:'F'
    },
    {
        id: 603, 
        title: 'Пол Акуфлекс-Супер, стяжка, 65 мм',
        description:'Звукоизолирующий пол на материале Акуфлекс-Супер',
        id_type:'F'
    },
    {
        id: 604, 
        title: 'Пол Шуманет-100Комби',
        description: 'Звукоизолирующий пол на материале Шуманет-100Комби',
        id_type:'F'
    },
    {
        id: 605, 
        title: 'Пол Шуманет-100Гидро',
        description:'Звукоизолирующий пол на материале Шуманет-100Гидро',
        id_type:'F'
    },
    {
        id: 606, 
        title: 'Пол Шумопласт',
        description: 'Звукоизолирующая выравнивающая смесь Шумопласт',
        id_type:'F'
    },
    {
        id: 607, 
        title: 'Пол Шумостоп-С2/К2, один слой',
        description: 'Звукоизолирующий пол с одним слоем системы плит Шумостоп-С2/К2',
        id_type:'F'
    },
    {
        id: 608, 
        title: 'Пол Шумостоп-С2/К2, два слоя',
        description: 'Звукоизолирующий пол с двумя слоями системы плит Шумостоп-С2/К2',
        id_type:'F'
    },
    {
        id: 609, 
        title: 'Пол Шумостоп-К2, один слой',
        description: 'Звукоизолирующий пол с одним слоем материала Шумостоп-К2',
        id_type:'F'
    },
    {
        id: 610, 
        title: 'Пол Шумостоп-К2, два слоя',
        description: 'Звукоизолирующий пол с двумя слоями материала Шумостоп-К2',
        id_type:'F'
    },
    {
        id: 611, 
        title: 'Пол Шуманет-Термо',
        description: 'Звукоизолирующий пол с одним слоем материала Шуманет-Термо',
        id_type:'F'
    },
    {
        id: 612, 
        title: 'Пол Шумостоп-Техно',
        description: 'Звукоизолирующий пол с применением панелей Шумостоп-Техно',
        id_type:'F'
    },
    {
        id: 613, 
        title: 'ЗИПС-ПОЛ Вектор',
        descriptio: 'Сборная звукоизолирующая система ЗИПС-ПОЛ Вектор',
        id_type:'F'
    },
    {
        id: 614, 
        title: 'ЗИПС-ПОЛ Модуль',
        description: 'Сборная звукоизолирующая система ЗИПС-ПОЛ Модуль',
        id_type:'F'
    },
    {
        id: 615, 
        title: 'Звукоизолирующий пол на лагах',
        description:'Звукоизолирующий пол на лагах',
        id_type:'F'
    },
    
];
  let select = document.querySelector('.wall');

  let test = document.getElementById('123');
 

 function prinOption (data,select) {

    let option = data.map((el)=>`<option value="${el.id}">${el.title}</option>`).join('');
    select.innerHTML = option;
        
}

function filtrData (data,param){

    return data.filter((el)=>el.id_type == param);
}

prinOption(filtrData(Constructions,'L'),select); 

select.onchange = function (){
    let imagePath = ImageCollection.find(el=>el.id == this.value);
    test.style.backgroundImage = `url(${imagePath.imgV})`;
    // test.style.transform = `rotate(270deg)`; 
 }

